In [168]:
import pandas as pd
import numpy as np 
from datetime import datetime
import matplotlib.pyplot as plt 
%matplotlib inline

In [169]:
! pip install scikit-learn

Requirement already satisfied: scikit-learn in c:\programdata\anaconda3\lib\site-packages (0.21.3)
Requirement already satisfied: numpy>=1.11.0 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (1.16.5)
Requirement already satisfied: scipy>=0.17.0 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (1.3.1)
Requirement already satisfied: joblib>=0.11 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (0.13.2)

In [170]:
#Read files
listings_df = pd.read_csv(r'C:\Users\rammr001\OneDrive - Vodafone Group\Documents\Data Science\dataset\listings.csv')
#listings_df.head()
calendar_df = pd.read_csv(r'C:\Users\rammr001\OneDrive - Vodafone Group\Documents\Data Science\dataset\calendar.csv')
#calendar_df.head
reviews_df = pd.read_csv(r'C:\Users\rammr001\OneDrive - Vodafone Group\Documents\Data Science\dataset\reviews.csv')
#reviews_df.head()

In [171]:
#Neighbourhood stats,
neighbourhood_df = listings_df['neighbourhood'].describe()
#top_ten_rated_nbh_df = neighbourhood_df.
#neighbourhood_df.plot(kind="bar");

neighbourhood_df

count             3402
unique              81
top       Capitol Hill
freq               351
Name: neighbourhood, dtype: object

In [172]:
listings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3818 entries, 0 to 3817
Data columns (total 92 columns):
id                                  3818 non-null int64
listing_url                         3818 non-null object
scrape_id                           3818 non-null int64
last_scraped                        3818 non-null object
name                                3818 non-null object
summary                             3641 non-null object
space                               3249 non-null object
description                         3818 non-null object
experiences_offered                 3818 non-null object
neighborhood_overview               2786 non-null object
notes                               2212 non-null object
transit                             2884 non-null object
thumbnail_url                       3498 non-null object
medium_url                          3498 non-null object
picture_url                         3818 non-null object
xl_picture_url                      3498 non-null object
host_id                             3818 non-null int64
host_url                            3818 non-null object
host_name                           3816 non-null object
host_since                          3816 non-null object
host_location                       3810 non-null object
host_about                          2959 non-null object
host_response_time                  3295 non-null object
host_response_rate                  3295 non-null object
host_acceptance_rate                3045 non-null object
host_is_superhost                   3816 non-null object
host_thumbnail_url                  3816 non-null object
host_picture_url                    3816 non-null object
host_neighbourhood                  3518 non-null object
host_listings_count                 3816 non-null float64
host_total_listings_count           3816 non-null float64
host_verifications                  3818 non-null object
host_has_profile_pic                3816 non-null object
host_identity_verified              3816 non-null object
street                              3818 non-null object
neighbourhood                       3402 non-null object
neighbourhood_cleansed              3818 non-null object
neighbourhood_group_cleansed        3818 non-null object
city                                3818 non-null object
state                               3818 non-null object
zipcode                             3811 non-null object
market                              3818 non-null object
smart_location                      3818 non-null object
country_code                        3818 non-null object
country                             3818 non-null object
latitude                            3818 non-null float64
longitude                           3818 non-null float64
is_location_exact                   3818 non-null object
property_type                       3817 non-null object
room_type                           3818 non-null object
accommodates                        3818 non-null int64
bathrooms                           3802 non-null float64
bedrooms                            3812 non-null float64
beds                                3817 non-null float64
bed_type                            3818 non-null object
amenities                           3818 non-null object
square_feet                         97 non-null float64
price                               3818 non-null object
weekly_price                        2009 non-null object
monthly_price                       1517 non-null object
security_deposit                    1866 non-null object
cleaning_fee                        2788 non-null object
guests_included                     3818 non-null int64
extra_people                        3818 non-null object
minimum_nights                      3818 non-null int64
maximum_nights                      3818 non-null int64
calendar_updated                    3818 non-null object
has_availability                    3818 non-null object
availability_30                     3818 non-null int64
availability_60                     3818 non-null int64
availability_90                     3818 non-null int64
availability_365                    3818 non-null int64
calendar_last_scraped               3818 non-null object
number_of_reviews                   3818 non-null int64
first_review                        3191 non-null object
last_review                         3191 non-null object
review_scores_rating                3171 non-null float64
review_scores_accuracy              3160 non-null float64
review_scores_cleanliness           3165 non-null float64
review_scores_checkin               3160 non-null float64
review_scores_communication         3167 non-null float64
review_scores_location              3163 non-null float64
review_scores_value                 3162 non-null float64
requires_license                    3818 non-null object
license                             0 non-null float64
jurisdiction_names                  3818 non-null object
instant_bookable                    3818 non-null object
cancellation_policy                 3818 non-null object
require_guest_profile_picture       3818 non-null object
require_guest_phone_verification    3818 non-null object
calculated_host_listings_count      3818 non-null int64
reviews_per_month                   3191 non-null float64
dtypes: float64(17), int64(13), object(62)
memory usage: 2.7+ MB

In [173]:
calendar_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1393570 entries, 0 to 1393569
Data columns (total 4 columns):
listing_id    1393570 non-null int64
date          1393570 non-null object
available     1393570 non-null object
price         934542 non-null object
dtypes: int64(1), object(3)
memory usage: 42.5+ MB

In [174]:
#calendar_df['date'].describe()
calendar_df["date"] = pd.to_datetime(calendar_df["date"])
calendar_df

         listing_id       date available   price
0            241032 2016-01-04         t  $85.00
1            241032 2016-01-05         t  $85.00
2            241032 2016-01-06         f     NaN
3            241032 2016-01-07         f     NaN
4            241032 2016-01-08         f     NaN
...             ...        ...       ...     ...
1393565    10208623 2016-12-29         f     NaN
1393566    10208623 2016-12-30         f     NaN
1393567    10208623 2016-12-31         f     NaN
1393568    10208623 2017-01-01         f     NaN
1393569    10208623 2017-01-02         f     NaN

[1393570 rows x 4 columns]

In [175]:
calendar_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1393570 entries, 0 to 1393569
Data columns (total 4 columns):
listing_id    1393570 non-null int64
date          1393570 non-null datetime64[ns]
available     1393570 non-null object
price         934542 non-null object
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 42.5+ MB

In [176]:
calendar_df['month']=calendar_df['date'].dt.month
calendar_df.head()

   listing_id       date available   price  month
0      241032 2016-01-04         t  $85.00      1
1      241032 2016-01-05         t  $85.00      1
2      241032 2016-01-06         f     NaN      1
3      241032 2016-01-07         f     NaN      1
4      241032 2016-01-08         f     NaN      1

In [177]:
x = calendar_df[calendar_df['available']=='t']
x[['available','month']]

        available  month
0               t      1
1               t      1
9               t      1
10              t      1
14              t      1
...           ...    ...
1393207         t      1
1393208         t      1
1393211         t      1
1393212         t      1
1393213         t      1

[934542 rows x 2 columns]

In [178]:
#Which month of the year ?
x['month'].describe()

count    934542.000000
mean          6.661120
std           3.446401
min           1.000000
25%           4.000000
50%           7.000000
75%          10.000000
max          12.000000
Name: month, dtype: float64

In [179]:
reviews_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84849 entries, 0 to 84848
Data columns (total 6 columns):
listing_id       84849 non-null int64
id               84849 non-null int64
date             84849 non-null object
reviewer_id      84849 non-null int64
reviewer_name    84849 non-null object
comments         84831 non-null object
dtypes: int64(3), object(3)
memory usage: 3.9+ MB

In [180]:
calendar_df.head()

   listing_id       date available   price  month
0      241032 2016-01-04         t  $85.00      1
1      241032 2016-01-05         t  $85.00      1
2      241032 2016-01-06         f     NaN      1
3      241032 2016-01-07         f     NaN      1
4      241032 2016-01-08         f     NaN      1

In [188]:
#How much should you budget
calendar_df = calendar_df.dropna()
calendar_df[['price']].describe()

          price
count    934542
unique      669
top     $150.00
freq      36646